In [36]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [14]:
import pandas as pd
visa_df=pd.read_csv(r"C:\Users\Harshini\One Drive\Documents\Data Science\Naresh IT\DataFiles\Visadataset - Visadataset.csv")
visa_df.head(2)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified

In [15]:
dict1={'Names':['Aravind','Samar',np.nan,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',np.nan]}
dict1

{'Names': ['Aravind', 'Samar', nan, 'Siri'],
 'Age': [nan, 21, 32, 43],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

In [16]:
pd.DataFrame(dict1)

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [20]:
d1=pd.DataFrame(dict1)

In [21]:
d1.dtypes

Names     object
Age      float64
City      object
dtype: object

In [22]:
dict2={'Names':['Aravind','Samar',None,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',None]}
pd.DataFrame(dict2)

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2     None  32.0  Chennai
3     Siri  43.0     None

In [23]:
d1.isnull()

   Names    Age   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [24]:
d1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [26]:
d1.isnull().sum()*100/len(d1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

- np.nan: not a number this application for numerical columns only

- Generally data has some empty rows

- It is a data problem

- If you read that kind of data you will see Null

- You need to understand it is a data corrupted or really a Null values are there

**method-1**

**Fill with some random value**

**method name:fill na**

In [28]:
d1.fillna(40)

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2       40  32.0  Chennai
3     Siri  43.0       40

**method-2**

- We can fill the values with respect to columns also

In [29]:
d1['Age'].fillna(40)

# It will not updated 
# inplace=False

0    40.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [30]:
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [31]:
d1['Age'].fillna(40,inplace=True)

In [32]:
d1

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2      NaN  32.0  Chennai
3     Siri  43.0      NaN

In [35]:
d1['Names'].fillna(40,inplace=False)

0    Aravind
1      Samar
2         40
3       Siri
Name: Names, dtype: object

In [37]:
dict1={'Names':['Aravind','Samar',np.nan,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',np.nan]}
d1=pd.DataFrame(dict1)

**method-3**

- bfill

- ffill

- pad

- backfill

In [38]:
d1.fillna(method='bfill')

# column1: Names index 4 is missing values it is filled with index 4 value
# column2: Age index 1 is missing value it is filled with index 2 value
# column3: city index 4 is missing value it should be fill with next value
#          but we dont have next value

     Names   Age     City
0  Aravind  21.0      Hyd
1    Samar  21.0      Blr
2     Siri  32.0  Chennai
3     Siri  43.0      NaN

In [44]:
d1.fillna(method='bfill',axis=1)
# axis=1 means column
#

     Names   Age     City
0  Aravind   Hyd      Hyd
1    Samar  21.0      Blr
2     32.0  32.0  Chennai
3     Siri  43.0      NaN

In [45]:
d1.fillna(method='ffill')

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2    Samar  32.0  Chennai
3     Siri  43.0  Chennai

In [46]:
d1.fillna(method='pad')

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2    Samar  32.0  Chennai
3     Siri  43.0  Chennai

In [47]:
d1.fillna(method='backfill')

     Names   Age     City
0  Aravind  21.0      Hyd
1    Samar  21.0      Blr
2     Siri  32.0  Chennai
3     Siri  43.0      NaN

- backfill and bill fill with Next value

- pad and ffill fill with previous value

- but it will change based on axis

**method-4**

- mean

    - Numerical values can fill with mean value
    
    - but mean affect by outliers
    
    - if we dont have outliers it is best one
    
- median

    - Numerical values can fill with median value
    
    - we know that median value does not affect wth outliers
    
    - so if outliers are there we can go with median
    
- mode

    - mode is useful for categorical data

In [48]:
dict1={'Names':['Aravind','Samar',np.nan,'Siri'],
       'Age':[np.nan,21,32,43],
       'City':['Hyd','Blr','Chennai',np.nan]}
d1=pd.DataFrame(dict1)

In [49]:
# we already know we can fll with same values basedon specific column using  
# d1.fillna(<random_number>)
# d1 represents all the columns
age_mean=d1['Age'].mean()
d1['Age'].fillna(age_mean)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [50]:
age_median=d1['Age'].median()
d1['Age'].fillna(age_median)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [51]:
age_mode=d1['Age'].mode()
d1['Age'].fillna(age_mode)

0    21.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [52]:
d1['City'].mode()
# In this use case we are getting mode equal
# But in real time we will get clear moode value

0        Blr
1    Chennai
2        Hyd
Name: City, dtype: object

- Fill with random value

- Fill with random value on specific value

- Fill with methods

   - bfill
    
   - ffill

   - pad
    
   - backfill

- Fill with

   - mean
    
   - median

   - mode

**method-5**

**KNN imputar**

- KNN: K neartest Neighbours
    
- K is a hyper parameter means user can choose

- It is distance metric: **Euclidian distance**
    
- KNN Imputer will take the mean of the neighbour value

- The neighbour value can provided by using value = k

- It is under sklearn package

- Under sklearn we have imputer method

- Under imputer method we have Knnimputer

- Applicable only for Numerical data

In [ ]:
from sklearn.impute import KNNImputer
KI=KNNImputer()
KI.fit_transform(d1[['Age']])